{"peft_type": "LORA", "auto_mapping": null, "base_model_name_or_path": "TinyLlama/TinyLlama-1.1B-Chat-v1.0", "revision": null, "task_type": "CAUSAL_LM", "inference_mode": false, "r": 16, "lora_alpha": 32, "lora_dropout": 0.05, "fan_in_fan_out": false, "bias": "none", "modules_to_save": null, "init_lora_weights": true, "layers_pattern": null, "use_dora": false, "target_modules": ["q_proj", "v_proj"]}